Практос_2/src/Documents/УтверждениеБюджета/УтверждениеБюджета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УтверждениеБюджета</name>
  <registerRecords>AccumulationRegister.БюджетМаркетингаHR</registerRecords>
  <attributes>
    <name>ПериодБюджета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставБюджета</name>
    <attributes>
      <name>ИсточникПривлечения</name>
      <type>
        <types>CatalogRef.ИсточникПривлечения</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатратНаПодбор</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Практос_2/src/AccumulationRegisters/БюджетМаркетингаHR/БюджетМаркетингаHR.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>БюджетМаркетингаHR</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИсточникПривлечения</name>
    <type>
      <types>CatalogRef.ИсточникПривлечения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатратНаПодбор</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Практос_2/src/Documents/УтверждениеБюджета/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр БюджетМаркетингаHR Приход
	Движения.БюджетМаркетингаHR.Записывать = Истина;
	Для Каждого ТекСтрокаСоставБюджета Из СоставБюджета Цикл
		Движение = Движения.БюджетМаркетингаHR.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ИсточникПривлечения = ТекСтрокаСоставБюджета.ИсточникПривлечения;
		Движение.СтатьяЗатрат = ТекСтрокаСоставБюджета.СтатьяЗатрат;
		Движение.Сумма = ТекСтрокаСоставБюджета.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
